app/views/delivery_slip_headers/_form.html.erb

    <%= f.label :"納品コード（参照）" , {:class => "my-custom-class-l"} %></br>
    <%= f.collection_select :delivery_slip_header_origin_id, DeliverySlipHeader.order('delivery_slip_code desc').all, :id, :delivery_slip_code, {:include_blank => true} ,
    {id:"delivery_slip_header_origin_id", :onchange => "CopyDeliverySlipHeader()", class: "searchableDeliverySlipOrigin" , style: 'width:150px' } %>
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" ORDER BY delivery_slip_code desc

  <!--<%= f.input :customer_id %>-->
  <%= f.collection_select :customer_id, CustomerMaster.all, :id, :customer_name, {:selected => @delivery_slip_header.customer_id || 1 } , {id:'customer_id', :class => "searchableCustomerName",  style: 'width:330px' , :tabindex=>"4"} %></br>
---
SELECT "customer_masters".* FROM "customer_masters"