app/views/quotation_headers/_form.html.erb

  <%= f.label :"見積コード（参照）" , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :quotation_header_origin_id, QuotationHeader.order('quotation_code desc').all, :id, :quotation_code, {:include_blank => true} ,
  {id:"quotation_header_origin_id", :onchange => "CopyQuotationHeader()", class: "searchableQuotationOrigin" , style: 'width:150px' } %>
---
SELECT "quotation_headers".* FROM "quotation_headers" ORDER BY quotation_code desc

  <!--<%= f.input :customer_id %>-->
  <%= f.collection_select :customer_id, CustomerMaster.all, :id, :customer_name, {:selected => @quotation_header.customer_id || 1 } ,
     {id:'customer_id', :class => "searchableCustomerName",  style: 'width:330px' , :tabindex=>"6"} %></br>
---
SELECT "customer_masters".* FROM "customer_masters"