app/pdfs/labor_cost_summary_pdf.rb

SELECT "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 ORDER BY "staffs"."id" ASC LIMIT $2
---
  def self.get_staff(position)
    staff_id = nil
    @staff = nil

    @staffs.each do |key,val|
      if val == position
        staff_id = key
      end
    end

    if staff_id.present?
      @staff = Staff.where(:id => staff_id).first