app/pdfs/purchase_order_pdf.rb

    #report.page.item(:supplier_responsible_name).value($purchase_order_history.supplier_master.responsible1 + "様")
    #担当は先頭を取ってくる---複数の場合に無理があるかも??
    #標準仕様--担当者のチェック
    if $purchase_order_history.supplier_master.supplier_responsibles[0].present? &&
       $purchase_order_history.supplier_master.supplier_responsibles[0].responsible_name.present?
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1  [["supplier_master_id", 4]]


    ##
    #標準仕様--会社情報
    company = Company.first
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]