app/views/inventory_histories/index.html.erb

SELECT "maker_masters".* FROM "maker_masters"
---
  <%= f.label :maker_code, 'メーカー：：' %>
  <%= f.select :with_maker_id, MakerMaster.all.map{|st| [st.maker_name, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableMakerName" } %>

SELECT "supplier_masters".* FROM "supplier_masters"
---
  <%= f.label :supplier_master_id, '仕入先：：' %>
  <%= f.select :supplier_master_id_eq, SupplierMaster.all.map{|st| [st.supplier_name, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableSupplierName" } %>

SELECT "customer_masters".* FROM "customer_masters"
SELECT "material_masters".* FROM "material_masters"
---
  <%= f.label :customer_id, '得意先：：' %>
  <%= f.select :with_customer, CustomerMaster.all.map{|st| [st.customer_name, st.id]}, {include_blank: true}, {style: 'width:440px' , class: "searchableCustomerName" } %></br>
  <%= f.label :material_code, '品番：：' %>
  <!--<%= f.select :with_material_code, MaterialMaster.all.map{|st| [st.material_code, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableMaterialCode" } %>-->

SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 LIMIT $2
---
        <% end %>
        <% if inventory_history.material_master.present? && inventory_history.material_master.MakerMaster.present? %>