app/views/purchase_order_histories/_form2.html.erb

SELECT "supplier_masters".* FROM "supplier_masters"
---
   <%= f.label :注文先　：, {style: 'color:blue'} %>
   <!--<%= f.collection_select :supplier_master_id, SupplierMaster.all, :id, :supplier_name, {:selected => f.object.supplier_master_id || 2} , { id:"supplier_master_id", class: "searchableId" , style: 'width:200px', :onchange => "setEmail()"} %>-->

   <%= f.collection_select :supplier_master_id, SupplierMaster.all, :id, :supplier_name,
   {:selected => f.object.supplier_master_id || 2} , { id:"supplier_master_id", class: "searchableId" , style: 'width:200px', :onchange => "setEmail()"} %>

SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1 ORDER BY sequential_id ASC  [["purchase_order_history_id", 50]]
---
	       <div id="subForms" class="sortDone" >
           	 <%= f.simple_fields_for :orders, @purchase_order_history.orders.order("sequential_id ASC"), :include_id => false  do |orders| %>