app/views/stocktakes/index.html.erb

SELECT "inventory_categories".* FROM "inventory_categories"
---
	<%= f.label :inventory_category, 'カテゴリー：' %>
    <%= f.select :with_material_category_include, InventoryCategory.all.map{|st| [st.name, st.id]}, {include_blank: true},
	      {style: 'width:220px' , class: "searchableCategory" } %></br>