app/views/construction_daily_reports/_form.html.erb

SELECT "staffs".* FROM "staffs"
---
  <%= f.label :作業員, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :staff_id, Staff.all, :id, :staff_name, {:prompt => "どれか一つを選択して下さい" } , {id:"staff_id", class: "my-custom-class" ,
      :tabindex=>"2", :onchange=> "getDailyPay(this.form)" }  %>