app/views/construction_daily_reports/_form.html.erb

SELECT "staffs".* FROM "staffs"
---
  <%= f.label :作業員, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :staff_id, Staff.all, :id, :staff_name, {:prompt => "どれか一つを選択して下さい" } , {id:"staff_id", class: "my-custom-class" ,
      :tabindex=>"2", :onchange=> "getDailyPay(this.form)" }  %>
  <%= f.collection_select :daily_pay, Staff.all, :id, :daily_pay, {:selected => @construction_daily_report.staff_id} , { id:"daily_pay" , :readonly => true } %>

SELECT "staffs".* FROM "staffs"
---
  <!--所属 add170707 -->
  <!--<%= f.collection_select :affiliation_id, Staff.all, :id, :affiliation_id,
         {:selected => @construction_daily_report.staff_id} , { id:"affiliation_id" }%>-->

SELECT "working_times".* FROM "working_times" ORDER BY "working_times"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
     //テキストへセット
     document.getElementById("working_times").value = kinmu_time + kinmu_time_2 ;