app/views/construction_daily_reports/index.html.erb

SELECT "staffs".* FROM "staffs"
---
  <%= f.label :staff_id, '社員' %>
  <!--<%= f.select :staff_id_eq, options_from_collection_for_select(Staff.all, "id", "staff_name") , {include_blank: true}, {id: 'staff_id_eq', style: 'width:220px' } %>-->

  <%= f.select :staff_id_eq, Staff.all.map{|st| [st.staff_name, st.id]}, {include_blank: true}, { id: 'staff_id_eq', style: 'width:220px'} %>

SELECT "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
        <!-- upd231111 -->
        <% if construction_daily_report.Staff.present? %>