app/views/quotation_material_headers/_form.html.erb

   <%= f.label :見積コード参照用：, {style: 'color:blue'} %>
   <%= f.select :quotation_header_origin_id, QuotationMaterialHeader.
        where(:construction_datum_id => params[:construction_id]).map{|st| [st.quotation_code, st.id]}, {include_blank: true},
         {id:"quotation_header_origin_id", style: 'width:200px' , class: "searchableQuotationOriginCode" } %>
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."construction_datum_id" = $1  [["construction_datum_id", 2]]

   <%= f.label :依頼先：, {style: 'color:blue'} %>
   <%= f.collection_select :supplier_master_id, SupplierMaster.all, :id, :supplier_name, {} ,
                        { id:"supplier_master_id", class: "searchableSupplier" , style: 'width:200px', :onchange => "setEmail()"} %>
---
SELECT "supplier_masters".* FROM "supplier_masters"

   <%= f.label :依頼先１：, {style: 'color:blue'} %>
   <%= f.collection_select :supplier_id_1, SupplierMaster.all, :id, :supplier_name, {include_blank: true} ,
                        { id:"supplier_id_1", class: "searchableId1" , style: 'width:200px'} %>
   <%= f.label :依頼先２：, {style: 'color:blue'} %>
   <%= f.collection_select :supplier_id_2, SupplierMaster.all, :id, :supplier_name, {include_blank: true} ,
                        { id:"supplier_id_2", class: "searchableId2" , style: 'width:200px'} %>
	<%= f.label :依頼先３：, {style: 'color:blue'} %>
   <%= f.collection_select :supplier_id_3, SupplierMaster.all, :id, :supplier_name, {include_blank: true} ,
                        { id:"supplier_id_3", class: "searchableId3" , style: 'width:200px'} %>
---
SELECT "supplier_masters".* FROM "supplier_masters"

   <%= f.label :担当者：, {:style => "color:blue"} %>
   <%= f.collection_select :responsible, SupplierResponsible.all, :id, :responsible_name, {include_blank: true},
                 {id:"supplier_responsible_id", class: "searchableResponsible" , style: 'width:200px'} %>
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles"

   <%= f.label :Email：, {:style => "color:blue"} %>
   <%= f.collection_select :email, SupplierResponsible.all, :id, :responsible_email, {:include_blank => true
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles"


			 <%= f.simple_fields_for :quotation_material_details, @quotation_material_header.quotation_material_details.order(@form_detail_order), :include_id => false  do |orders| %>
---
SELECT "quotation_material_details".* FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1 ORDER BY sequential_id ASC  [["quotation_material_header_id", 40]]