app/controllers/construction_costs_controller.rb

  def update

    #仕入金額・実行金額をセットする
    #upd170209 入力時に反映することにした。
    #set_amount

    #add210208
    #納品書・請求書データへ、確定申告区分をアップする
    set_final_return_divsion

    #binding.pry

    respond_to do |format|

      if @construction_cost.update(construction_cost_params)
---
UPDATE "construction_costs" SET "purchase_amount" = $1, "execution_amount" = $2, "purchase_order_amount" = $3, "updated_at" = $4 WHERE "construction_costs"."id" = $5

  def construction_labor_cost_select


    @construction_labor_cost_origin = ConstructionDailyReport.where(:construction_datum_id => params[:construction_datum_id]).sum(:labor_cost)
    @construction_labor_cost = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:labor_cost).flatten.join(" ")
---
SELECT SUM("construction_daily_reports"."labor_cost") FROM "construction_daily_reports" WHERE "construction_daily_reports"."construction_datum_id" = $1
SELECT "construction_costs"."labor_cost" FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1

  def purchase_order_amount_select

    #仕入明細データをセット
    #@purchase_order_amount = PurchaseDatum.joins(:purchase_order_datum).joins(:SupplierMaster).joins(:PurchaseDivision).
    #where(:construction_datum_id => params[:construction_datum_id]).
    #group('purchase_order_data.purchase_order_code').
    #pluck("purchase_divisions.purchase_division_long_name, supplier_masters.supplier_name, purchase_order_data.purchase_order_code, SUM(purchase_data.purchase_amount) ").flatten.join(",")

    #@purchase_order_amount = PurchaseDatum.joins(:purchase_order_datum).joins(:SupplierMaster).joins(:PurchaseDivision).
    #where(:construction_datum_id => params[:construction_datum_id]).
    #group('purchase_order_data.purchase_order_code').order('purchase_data.division_id, purchase_order_data.purchase_order_code').
    #pluck("purchase_divisions.purchase_division_long_name, supplier_masters.supplier_name, purchase_order_data.purchase_order_code, SUM(purchase_data.purchase_amount) ").flatten.join(",")

    @purchase_order_amount = PurchaseDatum.joins(:purchase_order_datum).joins(:SupplierMaster).joins(:PurchaseDivision).
    where(:construction_datum_id => params[:construction_datum_id]).
    group('purchase_order_data.purchase_order_code, purchase_divisions.purchase_division_long_name, supplier_masters.supplier_name,
          purchase_data.division_id').
    order('purchase_data.division_id, purchase_order_data.purchase_order_code').
    pluck(Arel.sql("purchase_divisions.purchase_division_long_name, supplier_masters.supplier_name,
          purchase_order_data.purchase_order_code, SUM(purchase_data.purchase_amount) ")).flatten.join(",")
  end

  def purchase_amount_etc_select

    #仕入金額を取得
    @purchase_amount = PurchaseDatum.where(:construction_datum_id => params[:construction_datum_id]).sum(:purchase_amount)

    #消耗品を取得
    @supplies_expense = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:supplies_expense).flatten.join(" ")

    #諸経費を取得
    @misellaneous_expense = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:misellaneous_expense).flatten.join(" ")

    #請負金額を取得
    @constructing_amount = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:constructing_amount).flatten.join(" ")


  end
  def purchase_amount_select
---
SELECT purchase_divisions.purchase_division_long_name, supplier_masters.supplier_name,
          purchase_order_data.purchase_order_code, SUM(purchase_data.purchase_amount)  FROM "purchase_data" INNER JOIN "purchase_order_data" ON "purchase_order_data"."id" = "purchase_data"."purchase_order_datum_id" INNER JOIN "supplier_masters" ON "supplier_masters"."id" = "purchase_data"."supplier_id" INNER JOIN "purchase_divisions" ON "purchase_divisions"."id" = "purchase_data"."division_id" WHERE "purchase_data"."construction_datum_id" = $1 GROUP BY purchase_order_data.purchase_order_code, purchase_divisions.purchase_division_long_name, supplier_masters.supplier_name, 
          purchase_data.division_id ORDER BY purchase_data.division_id, purchase_order_data.purchase_order_code
SELECT "construction_costs"."supplies_expense" FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1
SELECT "construction_costs"."misellaneous_expense" FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1
SELECT "construction_costs"."constructing_amount" FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1

  def set_construction_cost
    @construction_cost = ConstructionCost.find(params[:id])
---
SELECT "construction_costs".* FROM "construction_costs" WHERE "construction_costs"."id" = $1 LIMIT $2