app/controllers/delivery_slip_detail_large_classifications_controller.rb

  def get_public_flag

    $public_flag = false

    #delivery_slip_header = DeliverySlipHeader.find(params[:delivery_slip_header_id])
    #upd230720
    delivery_slip_header = DeliverySlipHeader.where(id: params[:delivery_slip_header_id]).first

    #if delivery_slip_header.customer_master.present?
    #upd230720
    if delivery_slip_header.present? && delivery_slip_header.customer_master.present?
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" WHERE "delivery_slip_headers"."id" = $1 ORDER BY "delivery_slip_headers"."id" ASC LIMIT $2  [["id", 1471], ["LIMIT", 1]]
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]

  def set_category_save_flag
    if @delivery_slip_detail_large_classification.delivery_slip_header_id.present?
      @delivery_slip_headers = DeliverySlipHeader.find_by(id: @delivery_slip_detail_large_classification.delivery_slip_header_id)
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers"
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" WHERE "delivery_slip_headers"."id" = $1 ORDER BY "delivery_slip_headers"."id" ASC LIMIT $2  [["id", 1471], ["LIMIT", 1]]