app/controllers/delivery_slip_detail_large_classifications_controller.rb

  def get_public_flag

    $public_flag = false

    #delivery_slip_header = DeliverySlipHeader.find(params[:delivery_slip_header_id])
    #upd230720
    delivery_slip_header = DeliverySlipHeader.where(id: params[:delivery_slip_header_id]).first

    #if delivery_slip_header.customer_master.present?
    #upd230720
    if delivery_slip_header.present? && delivery_slip_header.customer_master.present?
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" WHERE "delivery_slip_headers"."id" = $1 ORDER BY "delivery_slip_headers"."id" ASC LIMIT $2
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2