app/controllers/purchase_order_histories_controller.rb

SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."purchase_order_date" = $1 AND "purchase_order_histories"."purchase_order_datum_id" = $2 ORDER BY "purchase_order_histories"."id" ASC LIMIT $3  [["purchase_order_date", "2023-09-21"], ["purchase_order_datum_id", 3821], ["LIMIT", 1]]
---
  def get_data_on_create_twice
    tmp_history = PurchaseOrderHistory.where(purchase_order_date: params[:purchase_order_history][:purchase_order_date],
                                             purchase_order_datum_id: params[:purchase_order_history][:purchase_order_datum_id]).first

DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 323]]
---
  def destroy_before_update
    #すでに登録していた注文データは一旦抹消する。
    purchase_order_history_id = @purchase_order_history.id
    Order.where(purchase_order_history_id: purchase_order_history_id).destroy_all

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_params_complement

    i = 0

    #仕入先を画面で変更している場合があるので、その場合に差し替える
    if @purchase_order_history.supplier_master_id != params[:purchase_order_history][:supplier_master_id]
      @purchase_order_history.supplier_master_id = params[:purchase_order_history][:supplier_master_id]

      #注文データの仕入先も更新する
      purchase_order_data = PurchaseOrderDatum.find(@purchase_order_history.purchase_order_datum_id)
      if purchase_order_data.present?
        purchase_order_data_params = {supplier_master_id: params[:purchase_order_history][:supplier_master_id]}
        purchase_order_data.update(purchase_order_data_params)
      end
    end
    #

    if params[:purchase_order_history][:orders_attributes].present?

      params[:purchase_order_history][:orders_attributes].values.each do |item|

        if  item[:quantity].to_i == 0
          item[:quantity] = item[:quantity].tr('0-9a-zA-Z', '0-9a-zA-Z')
        end
        item[:quantity] = item[:quantity].to_i
        @maker_master = MakerMaster.where(:id => item[:maker_id]).first

SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
        #

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2  [["id", 3194], ["LIMIT", 1]]
---
            (item[:unit_master_id] != @material_master.unit_id )

            #品名・メーカーを登録or変更した場合は、商品マスターへ反映させる。
            materials = MaterialMaster.where(:id => @material_master.id).first

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '87' and material_id = '3194') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1  [["LIMIT", 1]]
---
            end
          end

          purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
          params[:purchase_order_history][:supplier_master_id], item[:material_id] ]).first

UPDATE "purchase_unit_prices" SET "unit_id" = $1, "updated_at" = $2 WHERE "purchase_unit_prices"."supplier_id" = $3 AND "purchase_unit_prices"."material_id" = $4  [["unit_id", 2], ["updated_at", "2023-09-22 15:39:09.727390"], ["supplier_id", 87], ["material_id", 3194]]
---
            unit_id: item[:unit_master_id], unit_price: unit_price}

            if purchase_unit_price.present?
              purchase_unit_price.update(purchase_unit_price_params)

SELECT "purchase_unit_prices"."unit_price" FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."material_id" = $1 AND "purchase_unit_prices"."supplier_id" = $2 AND (id is NOT NULL)  [["material_id", 4583], ["supplier_id", 87]]
---
  def material_select

    @material_code = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_code).flatten.join(" ")
    @material_name = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_name).flatten.join(" ")
    @list_price = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:list_price).flatten.join(" ")
    @maker_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:maker_id).flatten.join(" ")

    @material_category_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_category_id).flatten.join(" ")

    #add211222
    #単位はまず商品マスターから取得する(ここは見積・注文時のみ更新)、なければ仕入単価Mより取得
    @unit_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:unit_id).flatten.join(" ")

    if @unit_id.blank?  #ここは基本的に起こり得ない
      @unit_id = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                 params[:supplier_master_id], params[:id] ]).pluck(:unit_id).flatten.join(" ")
    end

    #いずれも該当なければひとまず”個”にする
    if @unit_id.blank?
      @unit_id = "3"
    end

    #supplier_master_id
    @order_unit_price = PurchaseUnitPrice.where(:material_id => params[:id], :supplier_id => params[:supplier_master_id]).
                        where("id is NOT NULL").pluck(:unit_price).flatten.join(" ")