app/controllers/purchase_order_data_controller.rb

SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "supplier_responsibles".* FROM "supplier_responsibles"
---
  def set_responsible

    @supplier_update_flag = 0  # 1:new  2:upd

    #画面のメアドをグローバルへセット
    #仕入先担当Ｍから選択できるようにした
    #$email_responsible = nil
    #$responsible_name = nil
    @email_responsible = nil
    @responsible_name = nil

    if params[:purchase_order_datum][:supplier_responsible_id].present?
      supplier_responsible = SupplierResponsible.where(id: params[:purchase_order_datum][:supplier_responsible_id]).first
      if supplier_responsible.present? && supplier_responsible.responsible_email.present?

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "supplier_masters".* FROM "supplier_masters"
---
    #$email_responsible2 = nil
    @email_responsible2 = nil
    if params[:purchase_order_datum][:supplier_master_id].present?
      supplier = SupplierMaster.where(id: params[:purchase_order_datum][:supplier_master_id]).first

      if supplier.present? && supplier.email_cc.present?

SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_email_when_id

    #メアドがIDの場合(違う名前で同一Emailの場合)
    if params[:purchase_order_datum][:supplier_responsible_attributes][:responsible_email].to_i > 0
      supplier_responsible = SupplierResponsible.where(id:
                                        params[:purchase_order_datum][:supplier_responsible_attributes][:responsible_email]).first

SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_responsible

    supplier_responsible_params = { supplier_master_id: params[:purchase_order_datum][:supplier_master_id],
                                    #responsible_name: $responsible_name,
                                    #responsible_email: $email_responsible
                                    responsible_name: @responsible_name,
                                    responsible_email: @email_responsible
                                  }

    case @supplier_update_flag
    when 1  #新規
      supplier_responsible = SupplierResponsible.new(supplier_responsible_params)
      supplier_responsible.save!(:validate => false)

      #パラメーターへ再び戻す
      params[:purchase_order_datum][:supplier_responsible_id] = supplier_responsible.id
    when 2  #更新
      supplier_responsible = SupplierResponsible.where(:id => params[:purchase_order_datum][:supplier_responsible_id]).first

SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2  [["supplier_master_id", 2], ["id", 1]]
---
  def set_email_default
  #担当emailの初期値をセット

    @supplier_responsibles = nil
    @supplier_responsible_emails = nil

    if @purchase_order_datum.supplier_master_id.present?
      supplier_master_id = @purchase_order_datum.supplier_master_id.to_i

      @supplier_responsibles = SupplierResponsible.where(:supplier_master_id => supplier_master_id)

SELECT "constants".* FROM "constants" WHERE "constants"."id" = $1 ORDER BY "constants"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_constant
    #constant = Constant.find(1)   #id=１に定数ファイルが保管されている
    #共通版対応
    constant = Constant.where(:id => 1).first

SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1  [["id", 1]]
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2  [["supplier_master_id", 2], ["id", 1]]
---
  def get_responsible_email
    @supplier_responsible_emails = SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")

    #仕入の担当者も全て加える
    @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_master_id]).
                                               where.not(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")