app/controllers/purchase_order_histories_controller.rb

SELECT "orders".* FROM "orders" INNER JOIN "purchase_order_histories" ON "purchase_order_histories"."id" = "orders"."purchase_order_history_id" WHERE (purchase_order_histories.purchase_order_datum_id = 3821) AND (orders.purchase_order_history_id = purchase_order_histories.id)
---
  def index2
    #一覧用
    purchase_order_datum_id = params[:purchase_order_datum_id].to_i
    if params[:purchase_order_datum_id].present?
      #$purchase_order_datum_id = purchase_order_datum_id
      @purchase_order_datum_id = purchase_order_datum_id
    end

    #一覧ヘッダ表示用
    @purchase_order_code = params[:purchase_order_code]
    @construction_name = params[:construction_name]
    @supplier_name = params[:supplier_name]

    @orders = Order.joins(:purchase_order_history).where("purchase_order_histories.purchase_order_datum_id = ?", purchase_order_datum_id)
    .where("orders.purchase_order_history_id = purchase_order_histories.id")

    if @orders.present?

SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2  [["id", 1207], ["LIMIT", 1]]
---
        #temp_id = $orders.pluck('purchase_order_history_id').first
        temp_id = @orders.pluck('purchase_order_history_id').first
        if temp_id.present?
          @tmp_purchase_order_history = PurchaseOrderHistory.find(temp_id)

SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1  [["supplier_master_id", 4]]
---
    def edit

      $quantity_nothing = false

      set_edit_params

      #納品場所が画面で指定されていたらセット(未登録の場合)
      if $delivery_place_flag.present?
      #if session[:delivery_place_flag].present?   #session変数がajaxと上手く連携できないため、ここだけやむなくglobalを使う
        if @purchase_order_history.delivery_place_flag.nil?
          @purchase_order_history.delivery_place_flag = $delivery_place_flag
          #@purchase_order_history.delivery_place_flag = session[:delivery_place_flag]
        end
      end

      #add210707
      #担当emailの初期値をセット
      set_email_default

      #連番の最大値を取る(フォーム用)
      get_max_seq

      #
      #ここは直で仕入先ID取るべきかも?
      @supplier_responsible = SupplierResponsible.where(:supplier_master_id =>
      @purchase_order_history.purchase_order_datum.supplier_master.id)

SELECT MAX("orders"."sequential_id") FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 50]]
---
    def get_max_seq

       @details = nil
      if @purchase_order_history.orders.present?

        @details = @purchase_order_history.orders
      end

      if  @details.present?
        if @details.maximum(:sequential_id).present?
          #$seq_exists = @details.maximum(:sequential_id)
          session[:seq_exists] = @details.maximum(:sequential_id)

SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
          @purchase_order_data  = PurchaseOrderDatum.find($id)
        elsif params[:purchase_order_history].present? &&
              params[:purchase_order_history][:purchase_order_datum_id].present?
          @purchase_order_data  = PurchaseOrderDatum.find(params[:purchase_order_history][:purchase_order_datum_id])

SELECT "supplier_masters".* FROM "supplier_masters"
SELECT "unit_masters".* FROM "unit_masters"
---
          @purchase_order_history.supplier_master_id = @purchase_order_data.supplier_master_id
        end
        #リロード用（注文業者をセット）
        if @purchase_order_history.supplier_master_id.blank?   #addd170914

SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 ORDER BY "unit_masters"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        end
        #add170721
        if @purchase_order_data.present?
          @supplier_master = SupplierMaster.find(@purchase_order_data.supplier_master_id)

SELECT "orders".* FROM "orders" WHERE (sequential_id IS NOT NULL) AND "orders"."purchase_order_history_id" = $1 ORDER BY sequential_id DESC LIMIT $2  [["purchase_order_history_id", 1198], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 50]]
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
---
        @purchase_order_history = $purchase_order_history
        #@purchase_order_history = @purchase_order_history_saved

        @purchase_order_data  = PurchaseOrderDatum.find($purchase_order_history.purchase_order_datum_id)
        @supplier_master = SupplierMaster.find($purchase_order_history.supplier_master_id)

SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 1207]]
---
        ##
        #連番を割り振る処理
        @orders = nil
        if @purchase_order_history.orders.present?

SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" IS NULL
---
    def set_email_default

      @supplier_responsibles = nil
      @supplier_responsible_emails = nil

      if @purchase_order_history.purchase_order_datum.supplier_responsible_id.present?

        @supplier_responsibles =
        SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")

SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."purchase_order_datum_id" = $1 AND "purchase_order_histories"."purchase_order_date" = $2 AND "purchase_order_histories"."supplier_master_id" = $3 LIMIT $4  [["purchase_order_datum_id", 3799], ["purchase_order_date", "2023-09-20"], ["supplier_master_id", 2], ["LIMIT", 1]]
---
    def get_data
      #
      $purchase_order_history = PurchaseOrderHistory.find_by(purchase_order_datum_id: params[:purchase_order_datum_id],
      purchase_order_date: params[:purchase_order_date] , supplier_master_id: params[:supplier_master_id])

INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "list_price", "order_unit_price", "order_price", "material_category_id", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
INSERT INTO "purchase_order_histories" ("purchase_order_date", "supplier_master_id", "purchase_order_datum_id", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    #binding.pry

    $id = params[:purchase_order_history][:purchase_order_datum_id]

    @purchase_order_history = PurchaseOrderHistory.new(purchase_order_history_params)

    #パラーメータ補完する
    set_params_complement

    @purchase_order_history = PurchaseOrderHistory.new(purchase_order_history_params)

    #メール送信済みフラグをセット
    #set_mail_sent_flag
    #binding.pry

    respond_to do |format|
      #if PurchaseOrderHistory.create(purchase_order_history_params)
      if @purchase_order_history.save!(:validate => false)

INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "list_price", "order_unit_price", "order_price", "material_category_id", "mail_sent_flag", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def update

    #del170724
    #すでに登録していた注文データは一旦抹消する。
    destroy_before_update

    #パラーメータ補完する
    set_params_complement

    #binding.pry

    respond_to do |format|

      #format.html

      #format.any ##???
      format.any { render json: purchase_order_history_params}

      @purchase_order_history.attributes = purchase_order_history_params
      #@quotation_headers.save(:validate => false)
      if @purchase_order_history.save!

DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 184]]
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 50]]
---
  def destroy_before_update
    #すでに登録していた注文データは一旦抹消する。
    purchase_order_history_id = @purchase_order_history.id
    Order.where(purchase_order_history_id: purchase_order_history_id).destroy_all

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 1210]]
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_params_complement

    i = 0

    #仕入先を画面で変更している場合があるので、その場合に差し替える
    if @purchase_order_history.supplier_master_id != params[:purchase_order_history][:supplier_master_id]
      @purchase_order_history.supplier_master_id = params[:purchase_order_history][:supplier_master_id]

      #注文データの仕入先も更新する
      purchase_order_data = PurchaseOrderDatum.find(@purchase_order_history.purchase_order_datum_id)
      if purchase_order_data.present?
        purchase_order_data_params = {supplier_master_id: params[:purchase_order_history][:supplier_master_id]}
        purchase_order_data.update(purchase_order_data_params)
      end
    end
    #

    if params[:purchase_order_history][:orders_attributes].present?

      params[:purchase_order_history][:orders_attributes].values.each do |item|

        if  item[:quantity].to_i == 0
          item[:quantity] = item[:quantity].tr('0-9a-zA-Z', '0-9a-zA-Z')
        end
        item[:quantity] = item[:quantity].to_i
        @maker_master = MakerMaster.where(:id => item[:maker_id]).first

SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        #

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first

SELECT "material_categories".* FROM "material_categories"
---

            @material_category = MaterialCategory.where(:name => item[:material_category_id]).first

            if @material_category.blank?

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2  [["id", 495], ["LIMIT", 1]]
---

        #手入力以外なら、商品CD・IDをセットする。
        if id != 1 then
          @material_master = MaterialMaster.find(id)

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2  [["id", 495], ["LIMIT", 1]]
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2  [["id", 3194], ["LIMIT", 1]]
---
            (item[:unit_master_id] != @material_master.unit_id )

            #品名・メーカーを登録or変更した場合は、商品マスターへ反映させる。
            materials = MaterialMaster.where(:id => @material_master.id).first
            if materials.present?

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '2' and material_id = '495') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1  [["LIMIT", 1]]
---
            end
          end

          purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
          params[:purchase_order_history][:supplier_master_id], item[:material_id] ]).first

UPDATE "purchase_unit_prices" SET "unit_id" = $1, "updated_at" = $2 WHERE "purchase_unit_prices"."supplier_id" = $3 AND "purchase_unit_prices"."material_id" = $4  [["unit_id", 2], ["updated_at", "2023-09-22 15:39:09.727390"], ["supplier_id", 87], ["material_id", 3194]]
---
            unit_id: item[:unit_master_id], unit_price: unit_price}

            if purchase_unit_price.present?
              purchase_unit_price.update(purchase_unit_price_params)

SELECT 1 AS one FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND "material_masters"."id" != $2 LIMIT $3  [["material_code", "WN1001"], ["id", 495], ["LIMIT", 1]]
---

              #仕入先単価マスターへも登録。
              @material_master = MaterialMaster.find_by(material_code: item[:material_code])
              if @material_master.present?

SELECT "material_masters"."material_code" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
SELECT "material_masters"."material_name" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
SELECT "material_masters"."list_price" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
SELECT "material_masters"."maker_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
SELECT "material_masters"."material_category_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
SELECT "material_masters"."unit_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
SELECT "purchase_unit_prices"."unit_price" FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."material_id" = $1 AND "purchase_unit_prices"."supplier_id" = $2 AND (id is NOT NULL)  [["material_id", 2], ["supplier_id", 4]]
SELECT "material_masters"."material_code" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 4583]]
SELECT "material_masters"."unit_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 4583]]
SELECT "purchase_unit_prices"."unit_price" FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."material_id" = $1 AND "purchase_unit_prices"."supplier_id" = $2 AND (id is NOT NULL)  [["material_id", 495], ["supplier_id", 2]]
---
  def material_select

    @material_code = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_code).flatten.join(" ")
    @material_name = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_name).flatten.join(" ")
    @list_price = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:list_price).flatten.join(" ")
    @maker_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:maker_id).flatten.join(" ")

    @material_category_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_category_id).flatten.join(" ")

    #add211222
    #単位はまず商品マスターから取得する(ここは見積・注文時のみ更新)、なければ仕入単価Mより取得
    @unit_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:unit_id).flatten.join(" ")

    if @unit_id.blank?  #ここは基本的に起こり得ない
      @unit_id = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                 params[:supplier_master_id], params[:id] ]).pluck(:unit_id).flatten.join(" ")
    end

    #いずれも該当なければひとまず”個”にする
    if @unit_id.blank?
      @unit_id = "3"
    end

    #supplier_master_id
    @order_unit_price = PurchaseUnitPrice.where(:material_id => params[:id], :supplier_id => params[:supplier_master_id]).
                        where("id is NOT NULL").pluck(:unit_price).flatten.join(" ")

SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
  def set_purchase_order_history
    @purchase_order_history = PurchaseOrderHistory.find(params[:id])

SELECT "maker_masters".* FROM "maker_masters"
---
  def set_masters
    @material_masters = MaterialMaster.all
    @unit_masters = UnitMaster.all
    @maker_masters = MakerMaster.all