app/controllers/quotation_material_headers_controller.rb

  def get_data_on_create_twice
    tmp_header = QuotationMaterialHeader.where(quotation_code: params[:quotation_material_header][:quotation_code]).first
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."quotation_code" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2  [["quotation_code", "2023092602"], ["LIMIT", 1]]

  def destroy_before_update
    #すでに登録していた注文データは一旦抹消する。
    quotation_material_header_id = @quotation_material_header.id
    QuotationMaterialDetail.where(quotation_material_header_id: quotation_material_header_id).destroy_all
---
DELETE FROM "quotation_material_details" WHERE "quotation_material_details"."id" = $1  [["id", 338]]
SELECT "quotation_material_details".* FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1  [["quotation_material_header_id", 48]]

          item[:quantity] = item[:quantity].tr('０-９ａ-ｚＡ-Ｚ', '0-9a-zA-Z')
        end

        @maker_master = MakerMaster.where(:id => item[:maker_id]).first
---
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

        end

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first
---
SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

              #↑フィールド追加時注意！
              #マスター情報変更した場合は、商品マスターへ反映させる。

            materials = MaterialMaster.where(:id => @material_master.id).first
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2  [["id", 495], ["LIMIT", 1]]


          #仕入単価マスターも更新する
          if params[:quotation_material_header][:supplier_master_id] != "1"   #手入力仕入先以外
            purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                   params[:quotation_material_header][:supplier_master_id], item[:material_id] ]).first
---
SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '2' and material_id = '495') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1  [["LIMIT", 1]]


        #再度ここで更新をかける(削除後)
        destroy_before_update
        @quotation_material_header.update(quotation_material_header_params)
---
UPDATE "quotation_material_headers" SET "quotation_email_flag_1" = $1, "updated_at" = $2 WHERE "quotation_material_headers"."id" = $3  [["quotation_email_flag_1", 1], ["updated_at", "2023-09-26 13:56:24.950855"], ["id", 48]]

  def email_select

    @email = SupplierMaster.where(:id => params[:supplier_id]).where("id is NOT NULL").pluck(:email1).flatten.join(" ")
	  @responsible = SupplierMaster.where(:id => params[:supplier_id]).where("id is NOT NULL").pluck(:responsible1).flatten.join(" ")

    purchase_order_data = PurchaseOrderDatum.where(:supplier_master_id => params[:supplier_id]).
                               where(:construction_datum_id => params[:construction_id]).first

    if purchase_order_data.present?

      #
      @supplier_responsibles = SupplierResponsible.where(:id => purchase_order_data.supplier_responsible_id).
               pluck("responsible_name, id")

      @supplier_responsibles += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => purchase_order_data.supplier_responsible_id).
                                            pluck("responsible_name, id")
      #
      #email
      @supplier_responsible_emails = SupplierResponsible.where(:id => purchase_order_data.supplier_responsible_id).
               pluck("responsible_email, id")

      @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => purchase_order_data.supplier_responsible_id).
                                            pluck("responsible_email, id")
      #
    else

      #見積データ存在する場合
      quotation_material_header = QuotationMaterialHeader.where(:id => params[:id]).first
---
SELECT "supplier_masters"."email1" FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 AND (id is NOT NULL)  [["id", 1]]
SELECT "supplier_masters"."responsible1" FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 AND (id is NOT NULL)  [["id", 1]]
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2  [["id", nil], ["LIMIT", 1]]

        @supplier_responsible_emails = SupplierResponsible.where(:id => supplier_responsible_id).
               pluck("responsible_email, id")

        @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => supplier_responsible_id).
                                          pluck("responsible_email, id")
---
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1  [["supplier_master_id", 1]]

    #

    #quotation_material_header = QuotationMaterialHeader.where(params[:id]).first
    quotation_material_header = QuotationMaterialHeader.where(:id => params[:id]).first
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def set_quotation_material_header
      @quotation_material_header = QuotationMaterialHeader.find(params[:id])
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]