app/controllers/quotation_headers_controller.rb

UPDATE "quotation_headers" SET "fixed_flag" = $1, "updated_at" = $2 WHERE "quotation_headers"."id" = $3  [["fixed_flag", 0], ["updated_at", "2023-09-20 13:33:00.456954"], ["id", 965]]
---
  def update

    #住所のパラメータを正常化
    adjust_address_params

    #add170809
    #手入力時の顧客マスターの新規登録
  	create_manual_input_customer

    #見出しデータ（コピー元）の補完
    complementCopyHeader

    #add220620
    #工事コード変更した場合でも見積もりフラグを抹消
    #delete_construction_quotation_flag_when_changed
    delete_construction_quotation_flag(FLAG_WHEN_UPDATE)

    respond_to do |format|
      if @quotation_header.update(quotation_header_params)

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
  def update_params_customer
    #顧客Mの敬称・担当を更新する(未登録の場合)

    if params[:quotation_header][:customer_master_attributes].present?

      id = params[:quotation_header][:customer_id].to_i
      @customer_masters = CustomerMaster.find(id)

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2  [["id", 965], ["LIMIT", 1]]
SELECT "quotation_headers".* FROM "quotation_headers" ORDER BY quotation_code desc
UPDATE "quotation_headers" SET "fixed_flag" = $1, "updated_at" = $2 WHERE "quotation_headers"."id" = $3  [["fixed_flag", 1], ["updated_at", "2023-09-20 13:33:20.951902"], ["id", 965]]
---
  def set_fixed
    if params[:quotation_header_id].present?
      quotation_header = QuotationHeader.find_by(id: params[:quotation_header_id])
      if quotation_header.present?
        quotation_header.assign_attributes(:fixed_flag => 1)
        quotation_header.save(validate: false)

SELECT 1 AS one FROM "quotation_headers" WHERE "quotation_headers"."quotation_code" = $1 AND "quotation_headers"."id" != $2 LIMIT $3  [["quotation_code", "2023090501"], ["id", 965], ["LIMIT", 1]]
---
  def set_quotation_code

    #パラメーターからコードを作る
    dateStr = format("%04d%02d%02d", params[:year], params[:month], params[:day] )

    codeMin = dateStr + "00"
    codeMax = dateStr + "98"  #１日99件以上は考慮しない

    tmp_quotation_header_code = QuotationHeader.where(quotation_code: codeMin..codeMax).maximum(:quotation_code)

    @new_code = nil

    if tmp_quotation_header_code.present?

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2  [["id", 965], ["LIMIT", 1]]
---
  def set_quotation_header
    @quotation_header = QuotationHeader.find(params[:id])