app/controllers/quotation_detail_large_classifications_controller.rb

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 ORDER BY "quotation_headers"."id" ASC LIMIT $2
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
---
  def get_public_flag

    $public_flag = false

    #quotation_header = QuotationHeader.find(params[:quotation_header_id])
    #upd230720
    quotation_header = QuotationHeader.where(id: params[:quotation_header_id]).first

    #if quotation_header.customer_master.present?
    #upd230720
    if quotation_header.present? && quotation_header.customer_master.present?