app/controllers/quotation_material_headers_controller.rb

        @quotation_material_header = QuotationMaterialHeader.new
      else
        #リロードした場合 #add230912
        @quotation_material_header = QuotationMaterialHeader.where(id: session[:quotation_material_headers_id]).first
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2

  def material_select
    @material_code = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_code).flatten.join(" ")
    @material_name = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_name).flatten.join(" ")
    @list_price = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:list_price).flatten.join(" ")
    @maker_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:maker_id).flatten.join(" ")

    #単位はまず商品マスターから取得する(ここは見積・注文時のみ更新)、なければ仕入単価Mより取得
    @unit_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:unit_id).flatten.join(" ")

    if @unit_id.blank?  #ここは基本的に起こり得ない
 	    @unit_id = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                 params[:supplier_master_id], params[:id] ]).pluck(:unit_id).flatten.join(" ")
    end

    #どちらも該当なければひとまず”個”にする
    if @unit_id.blank?
      @unit_id = "3"
    end

    @notes = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:notes).flatten.join(" ")

    @material_category_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_category_id).flatten.join(" ")
---
SELECT "material_masters"."material_code" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."material_name" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."list_price" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."maker_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."unit_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."notes" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."material_category_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)

  def get_last_quotation_code_select

    #当日を取得
    require 'date'
    now_date =Date.today.to_time
    now_date = now_date.strftime("%Y%m%d")

    #quotation_new_code_temp = QuotationMaterialHeader.all.maximum(:quotation_code)
    quotation_new_code_temp = QuotationMaterialHeader.where("LEFT(quotation_code,8) = ?", now_date).maximum(:quotation_code)
---
SELECT MAX("quotation_material_headers"."quotation_code") FROM "quotation_material_headers" WHERE (LEFT(quotation_code,8) = '20230926')

  def create

    @quotation_material_header = QuotationMaterialHeader.new(quotation_material_header_params)

    #備考１〜３のいずれかへセット
    set_notes_before_save

    #仕入先未登録の場合にセット
    set_supplier_before_save

    #パラーメータ補完＆メール送信する
    set_params_complement

    #連番を逆にする！！！
    #reverse_seq

    @quotation_material_header = QuotationMaterialHeader.new(quotation_material_header_params)

    #binding.pry

    respond_to do |format|
      if @quotation_material_header.save!(:validate => false)
---
INSERT INTO "quotation_material_headers" ("quotation_code", "requested_date", "construction_datum_id", "supplier_master_id", "responsible", "email", "total_quotation_price_1", "total_quotation_price_2", "total_quotation_price_3", "total_order_price_1", "total_order_price_2", "total_order_price_3", "supplier_id_1", "quotation_email_flag_1", "quotation_email_flag_2", "quotation_email_flag_3", "order_email_flag_1", "order_email_flag_2", "order_email_flag_3", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"

  def update

	  if @quotation_material_header.quotation_code == params[:quotation_material_header][:quotation_code]

      #備考１〜３のいずれかへセット
      set_notes_before_save

      #仕入先未登録の場合にセット
      set_supplier_before_save

      #すでに登録していた注文データは一旦抹消する。
	    destroy_before_update

      #パラーメータ補完＆メール送信する
      set_params_complement

      respond_to do |format|

        if @quotation_material_header.update(quotation_material_header_params)
---
UPDATE "quotation_material_headers" SET "notes_1" = $1, "updated_at" = $2 WHERE "quotation_material_headers"."id" = $3

  def destroy_before_update
    #すでに登録していた注文データは一旦抹消する。
    quotation_material_header_id = @quotation_material_header.id
    QuotationMaterialDetail.where(quotation_material_header_id: quotation_material_header_id).destroy_all
---
DELETE FROM "quotation_material_details" WHERE "quotation_material_details"."id" = $1
SELECT "quotation_material_details".* FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1

          item[:quantity] = item[:quantity].tr('０-９ａ-ｚＡ-Ｚ', '0-9a-zA-Z')
        end

        @maker_master = MakerMaster.where(:id => item[:maker_id]).first
---
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2

        end

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first
---
SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2


        #手入力以外なら、商品CD・IDをセットする。
        if id != 1 then
          @material_master = MaterialMaster.find(id)
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2

              #↑フィールド追加時注意！
              #マスター情報変更した場合は、商品マスターへ反映させる。

            materials = MaterialMaster.where(:id => @material_master.id).first
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2


          #仕入単価マスターも更新する
          if params[:quotation_material_header][:supplier_master_id] != "1"   #手入力仕入先以外
            purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                   params[:quotation_material_header][:supplier_master_id], item[:material_id] ]).first
---
SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '4' and material_id = '2') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1

    #$email_responsible2 = nil
    @email_responsible2 = nil
    if params[:quotation_material_header][:supplier_master_id].present?
      supplier = SupplierMaster.where(id: params[:quotation_material_header][:supplier_master_id]).first

      if supplier.present? && supplier.email_cc.present?
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2


        #再度ここで更新をかける(削除後)
        destroy_before_update
        @quotation_material_header.update(quotation_material_header_params)
---
UPDATE "quotation_material_headers" SET "quotation_email_flag_1" = $1, "updated_at" = $2 WHERE "quotation_material_headers"."id" = $3

  def email_select

    @email = SupplierMaster.where(:id => params[:supplier_id]).where("id is NOT NULL").pluck(:email1).flatten.join(" ")
	  @responsible = SupplierMaster.where(:id => params[:supplier_id]).where("id is NOT NULL").pluck(:responsible1).flatten.join(" ")

    purchase_order_data = PurchaseOrderDatum.where(:supplier_master_id => params[:supplier_id]).
                               where(:construction_datum_id => params[:construction_id]).first

    if purchase_order_data.present?

      #
      @supplier_responsibles = SupplierResponsible.where(:id => purchase_order_data.supplier_responsible_id).
               pluck("responsible_name, id")

      @supplier_responsibles += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => purchase_order_data.supplier_responsible_id).
                                            pluck("responsible_name, id")
      #
      #email
      @supplier_responsible_emails = SupplierResponsible.where(:id => purchase_order_data.supplier_responsible_id).
               pluck("responsible_email, id")

      @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => purchase_order_data.supplier_responsible_id).
                                            pluck("responsible_email, id")
      #
    else

      #見積データ存在する場合
      quotation_material_header = QuotationMaterialHeader.where(:id => params[:id]).first
---
SELECT "supplier_masters"."email1" FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 AND (id is NOT NULL)
SELECT "supplier_masters"."responsible1" FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 AND (id is NOT NULL)
SELECT responsible_name, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2

      if supplier_responsible_id.present? && supplier_responsible_id > 0

        #
        @supplier_responsibles = SupplierResponsible.where(:id => supplier_responsible_id).
               pluck("responsible_name, id")

        @supplier_responsibles += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => supplier_responsible_id).
                                            pluck("responsible_name, id")
---
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2

        @supplier_responsible_emails = SupplierResponsible.where(:id => supplier_responsible_id).
               pluck("responsible_email, id")

        @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => supplier_responsible_id).
                                          pluck("responsible_email, id")
---
SELECT responsible_name, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1

      #該当なし => all
        @supplier_responsibles = SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               pluck("responsible_name, id")
        @supplier_responsible_emails = SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               pluck("responsible_email, id")
---
SELECT responsible_name, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1

    #

    #quotation_material_header = QuotationMaterialHeader.where(params[:id]).first
    quotation_material_header = QuotationMaterialHeader.where(:id => params[:id]).first
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2