app/controllers/quotation_headers_controller.rb

SELECT "customer_masters"."customer_name" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."post" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."address" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."house_number" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."address2" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."tel_main" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."fax_main" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."responsible1" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."responsible2" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
SELECT "customer_masters"."honorific_id" FROM "customer_masters" WHERE "customer_masters"."id" = $1 AND (id is NOT NULL)
---
  def customer_info_select
    @customer_name = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:customer_name).flatten.join(" ")
    @post = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:post).flatten.join(" ")
    @address = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:address).flatten.join(" ")
    #add171012
    @house_number = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:house_number).flatten.join(" ")
    @address2 = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:address2).flatten.join(" ")
    #add end
    @tel = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:tel_main).flatten.join(" ")
    @fax = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:fax_main).flatten.join(" ")
    @responsible1 = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:responsible1).flatten.join(" ")
    @responsible2 = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:responsible2).flatten.join(" ")
    #敬称
    id  = CustomerMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:honorific_id).flatten.join(" ").to_i

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
  def set_quotation_header
    @quotation_header = QuotationHeader.find(params[:id])