app/views/quotation_detail_large_classifications/index.html.erb

SELECT "quotation_headers".* FROM "quotation_headers"
SELECT "quotation_detail_large_classifications"."id", "quotation_detail_large_classifications"."working_large_item_name" FROM "quotation_detail_large_classifications" GROUP BY "quotation_detail_large_classifications"."id", "quotation_detail_large_classifications"."working_large_item_name"
---
  <%= f.label :construction_code, '見積Ｎｏ　' %>
  <%= f.select :quotation_header_id_eq, options_from_collection_for_select(QuotationHeader.all, "id", "quotation_code") , {include_blank: true}, {style: 'width:220px' , class: "searchableQuotationCode" } %>
  <%= f.label :construction_code, '件名　' %>
  <%= f.select :with_header_id, options_from_collection_for_select(QuotationHeader.all, "id", "construction_name") , {include_blank: true}, {style: 'width:220px' , class: "searchableConstructionName" } %></br>
  <%= f.label :working_large_item, '品目名　' %>
  <%= f.select :working_large_item_name_eq, options_from_collection_for_select(QuotationDetailLargeClassification.select(:id, :working_large_item_name).
                              group(:id, :working_large_item_name), "working_large_item_name","working_large_item_name" ) , {include_blank: true}, {style: 'width:220px' , class: "searchableLargeItem" } %></br>